fire/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format		ascii;
    class       dictionary;
    location    "system";
    object		controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	buoyantReactingFoam;

startFrom       	latestTime;

startTime       	0.0;

stopAt          	endTime;

endTime         	4.0;

deltaT          	0.001;

writeControl    	adjustableRunTime;

writeInterval   	0.1;

purgeWrite      	0;

writeFormat     	binary;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

graphFormat     	raw;

runTimeModifiable 	yes;

adjustTimeStep  	yes;

maxCo           	0.5;

maxDeltaT       	1.0;

// ************************************************************************* //
