fire/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver			PCG;
        preconditioner	DIC;
        tolerance		1e-6;
        relTol			0;
    };

    p_rgh
    {
        solver			GAMG;
        tolerance		1e-6;
        relTol			0.1;
        smoother		GaussSeidel;
    };

    p_rghFinal
    {
        $p_rgh;
        tolerance		1e-6;
        relTol			0;
    };

    ph_rgh
    {
        $p_rgh;
    }


    "(U|Yi|k|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
        nSweeps         1;
    };

    "(U|Yi|k|h)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    };

    "Ii.*"
    {
        solver			GAMG;
        tolerance		1e-4;
        relTol			0;
        smoother		symGaussSeidel;
        maxIter			1;
        nPostSweeps		1;
    }

    "G.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor 			yes;
    hydrostaticInitialisation 	yes;
    nHydrostaticCorrectors 		5;
    nOuterCorrectors  			1;
    nCorrectors					2;
    nNonOrthogonalCorrectors	0;
}

relaxationFactors
{
}

// ************************************************************************* //
